#Написать функцию, вычисляющую сумму двух переданных чисел.
num1 = 51
num2 = 23

def sum(x,y):
    return(int(x)+int(y))
print(sum(num1,num2))
