#Дано натуральное число n. Выведите все числа от 1 до n.
#Без использования циклов.

n = 51
print(*range(n))
