#Дано натуральное число N. Выведите все его цифры по одной, в обратном порядке,
#разделяя их пробелами или новыми строками. При решении этой задачи нельзя
#использовать строки, списки, массивы (ну и циклы, разумеется).

def printReverse(x):
    y = x.list(str(x))
    print(y)
#n = 50
#print(*range(n))

printReverse(123)
